/*	여러 줄 주석
	js와 주석 동일
	
	클래스명 반드시 대문자로 시작
	클래스명명 규칙: 두 단어의 조합일 경우, 카멜백 기법으로 작성
	파일명 규칙: Java는 클래스명과 파일명이 반드시 일치해야 함
			좋은 습관 - 파일명 저장 시 직접 작성x, 복사해 쓰기
*/ 
//한 줄 주석

class DataType {
	// Java의 기본자료형도 다른 언어와 마찬가지로, 3가지 종류 (문자, 숫자, 논리값)
	// let x=5; // Js는 데이터의 종류를 신경쓸 필요가 없다 (초보자에게 큰 부담 없는 언어)
	int y=7; // 컴파일 기반의 언어적 특성 때문에, 반드시 변수 선언할 때 자료형의 종류를 결정지어 줘야 함
	
	public static void main (String[] args){
		System.out.println("Hello World");
	}
	// 이 클래스를 실행할 수 있는 클래스로 정의하려면, java.exe의 대상이 되려면
	//반드시 main 매서드 정의하기
}
	//컴파일 기반 언어 (c,c++,java,c# 등)의 특징
	//단점) 실행 전 컴파일 과정이 번거로울 수 있음
	//		초보자들에게 진입장벽이 높음
	//장점) 일단 한 번 자료형, 문법 검사(compile)가 끝나면 그 결과물을
	//		바이너리 파일로 저장해놓고, 이 후부터는 두 번 다시 문법검사 수행하는 것이 아니라
	//		컴파일 결과물로 생성된 기계어를 실행하기 때문에
	//		이 시점부터는 인터프리터 언어에 비해 속도가 훨씬 빠르다